casapudenis/CY8CKIT-062-BLE/CE222221_Voice_Recorder01/CE222221_Voice_Recorder01.cydsn/codegentemp/cyfitter_gpio.h
/*******************************************************************************
* File Name: cyfitter_gpio.h
* 
* PSoC Creator  4.4
*
* Description:
* 
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#ifndef INCLUDED_CYFITTER_GPIO_H
#define INCLUDED_CYFITTER_GPIO_H
#include "cy_device_headers.h"

/* MCLK */
#define MCLK_0_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define MCLK_0_INBUF_ENABLED 0u
#define MCLK_0_INIT_DRIVESTATE 1u
#define MCLK_0_INIT_MUXSEL 3u
#define MCLK_0_INPUT_SYNC 2u
#define MCLK_0_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define MCLK_0_NUM 0u
#define MCLK_0_PORT GPIO_PRT5
#define MCLK_0_SLEWRATE CY_GPIO_SLEW_FAST
#define MCLK_0_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS
#define MCLK_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define MCLK_INBUF_ENABLED 0u
#define MCLK_INIT_DRIVESTATE 1u
#define MCLK_INIT_MUXSEL 3u
#define MCLK_INPUT_SYNC 2u
#define MCLK_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define MCLK_NUM 0u
#define MCLK_PORT GPIO_PRT5
#define MCLK_SLEWRATE CY_GPIO_SLEW_FAST
#define MCLK_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS

/* TX_WS */
#define TX_WS_0_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define TX_WS_0_INBUF_ENABLED 0u
#define TX_WS_0_INIT_DRIVESTATE 1u
#define TX_WS_0_INIT_MUXSEL 22u
#define TX_WS_0_INPUT_SYNC 2u
#define TX_WS_0_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define TX_WS_0_NUM 2u
#define TX_WS_0_PORT GPIO_PRT5
#define TX_WS_0_SLEWRATE CY_GPIO_SLEW_FAST
#define TX_WS_0_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS
#define TX_WS_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define TX_WS_INBUF_ENABLED 0u
#define TX_WS_INIT_DRIVESTATE 1u
#define TX_WS_INIT_MUXSEL 22u
#define TX_WS_INPUT_SYNC 2u
#define TX_WS_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define TX_WS_NUM 2u
#define TX_WS_PORT GPIO_PRT5
#define TX_WS_SLEWRATE CY_GPIO_SLEW_FAST
#define TX_WS_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS

/* TX_SCK */
#define TX_SCK_0_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define TX_SCK_0_INBUF_ENABLED 0u
#define TX_SCK_0_INIT_DRIVESTATE 1u
#define TX_SCK_0_INIT_MUXSEL 22u
#define TX_SCK_0_INPUT_SYNC 2u
#define TX_SCK_0_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define TX_SCK_0_NUM 1u
#define TX_SCK_0_PORT GPIO_PRT5
#define TX_SCK_0_SLEWRATE CY_GPIO_SLEW_FAST
#define TX_SCK_0_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS
#define TX_SCK_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define TX_SCK_INBUF_ENABLED 0u
#define TX_SCK_INIT_DRIVESTATE 1u
#define TX_SCK_INIT_MUXSEL 22u
#define TX_SCK_INPUT_SYNC 2u
#define TX_SCK_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define TX_SCK_NUM 1u
#define TX_SCK_PORT GPIO_PRT5
#define TX_SCK_SLEWRATE CY_GPIO_SLEW_FAST
#define TX_SCK_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS

/* TX_SDO */
#define TX_SDO_0_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define TX_SDO_0_INBUF_ENABLED 0u
#define TX_SDO_0_INIT_DRIVESTATE 1u
#define TX_SDO_0_INIT_MUXSEL 22u
#define TX_SDO_0_INPUT_SYNC 2u
#define TX_SDO_0_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define TX_SDO_0_NUM 3u
#define TX_SDO_0_PORT GPIO_PRT5
#define TX_SDO_0_SLEWRATE CY_GPIO_SLEW_FAST
#define TX_SDO_0_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS
#define TX_SDO_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define TX_SDO_INBUF_ENABLED 0u
#define TX_SDO_INIT_DRIVESTATE 1u
#define TX_SDO_INIT_MUXSEL 22u
#define TX_SDO_INPUT_SYNC 2u
#define TX_SDO_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define TX_SDO_NUM 3u
#define TX_SDO_PORT GPIO_PRT5
#define TX_SDO_SLEWRATE CY_GPIO_SLEW_FAST
#define TX_SDO_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS

/* PDM_CLK */
#define PDM_CLK_0_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define PDM_CLK_0_INBUF_ENABLED 0u
#define PDM_CLK_0_INIT_DRIVESTATE 1u
#define PDM_CLK_0_INIT_MUXSEL 21u
#define PDM_CLK_0_INPUT_SYNC 2u
#define PDM_CLK_0_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define PDM_CLK_0_NUM 4u
#define PDM_CLK_0_PORT GPIO_PRT10
#define PDM_CLK_0_SLEWRATE CY_GPIO_SLEW_FAST
#define PDM_CLK_0_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS
#define PDM_CLK_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define PDM_CLK_INBUF_ENABLED 0u
#define PDM_CLK_INIT_DRIVESTATE 1u
#define PDM_CLK_INIT_MUXSEL 21u
#define PDM_CLK_INPUT_SYNC 2u
#define PDM_CLK_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define PDM_CLK_NUM 4u
#define PDM_CLK_PORT GPIO_PRT10
#define PDM_CLK_SLEWRATE CY_GPIO_SLEW_FAST
#define PDM_CLK_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS

/* Pin_LSB */
#define Pin_LSB_0_DRIVEMODE CY_GPIO_DM_STRONG
#define Pin_LSB_0_INBUF_ENABLED 1u
#define Pin_LSB_0_INIT_DRIVESTATE 1u
#define Pin_LSB_0_INIT_MUXSEL 2u
#define Pin_LSB_0_INPUT_SYNC 2u
#define Pin_LSB_0_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define Pin_LSB_0_NUM 0u
#define Pin_LSB_0_PORT GPIO_PRT9
#define Pin_LSB_0_SLEWRATE CY_GPIO_SLEW_FAST
#define Pin_LSB_0_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS
#define Pin_LSB_1_DRIVEMODE CY_GPIO_DM_STRONG
#define Pin_LSB_1_INBUF_ENABLED 1u
#define Pin_LSB_1_INIT_DRIVESTATE 1u
#define Pin_LSB_1_INIT_MUXSEL 2u
#define Pin_LSB_1_INPUT_SYNC 2u
#define Pin_LSB_1_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define Pin_LSB_1_NUM 1u
#define Pin_LSB_1_PORT GPIO_PRT9
#define Pin_LSB_1_SLEWRATE CY_GPIO_SLEW_FAST
#define Pin_LSB_1_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS
#define Pin_LSB_2_DRIVEMODE CY_GPIO_DM_STRONG
#define Pin_LSB_2_INBUF_ENABLED 1u
#define Pin_LSB_2_INIT_DRIVESTATE 1u
#define Pin_LSB_2_INIT_MUXSEL 2u
#define Pin_LSB_2_INPUT_SYNC 2u
#define Pin_LSB_2_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define Pin_LSB_2_NUM 2u
#define Pin_LSB_2_PORT GPIO_PRT9
#define Pin_LSB_2_SLEWRATE CY_GPIO_SLEW_FAST
#define Pin_LSB_2_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS
#define Pin_LSB_3_DRIVEMODE CY_GPIO_DM_STRONG
#define Pin_LSB_3_INBUF_ENABLED 1u
#define Pin_LSB_3_INIT_DRIVESTATE 1u
#define Pin_LSB_3_INIT_MUXSEL 2u
#define Pin_LSB_3_INPUT_SYNC 2u
#define Pin_LSB_3_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define Pin_LSB_3_NUM 4u
#define Pin_LSB_3_PORT GPIO_PRT9
#define Pin_LSB_3_SLEWRATE CY_GPIO_SLEW_FAST
#define Pin_LSB_3_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS
#define Pin_LSB_4_DRIVEMODE CY_GPIO_DM_STRONG
#define Pin_LSB_4_INBUF_ENABLED 1u
#define Pin_LSB_4_INIT_DRIVESTATE 1u
#define Pin_LSB_4_INIT_MUXSEL 2u
#define Pin_LSB_4_INPUT_SYNC 2u
#define Pin_LSB_4_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define Pin_LSB_4_NUM 5u
#define Pin_LSB_4_PORT GPIO_PRT9
#define Pin_LSB_4_SLEWRATE CY_GPIO_SLEW_FAST
#define Pin_LSB_4_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS
#define Pin_LSB_5_DRIVEMODE CY_GPIO_DM_STRONG
#define Pin_LSB_5_INBUF_ENABLED 1u
#define Pin_LSB_5_INIT_DRIVESTATE 1u
#define Pin_LSB_5_INIT_MUXSEL 2u
#define Pin_LSB_5_INPUT_SYNC 2u
#define Pin_LSB_5_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define Pin_LSB_5_NUM 2u
#define Pin_LSB_5_PORT GPIO_PRT0
#define Pin_LSB_5_SLEWRATE CY_GPIO_SLEW_FAST
#define Pin_LSB_5_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS
#define Pin_LSB_6_DRIVEMODE CY_GPIO_DM_STRONG
#define Pin_LSB_6_INBUF_ENABLED 1u
#define Pin_LSB_6_INIT_DRIVESTATE 1u
#define Pin_LSB_6_INIT_MUXSEL 2u
#define Pin_LSB_6_INPUT_SYNC 2u
#define Pin_LSB_6_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define Pin_LSB_6_NUM 0u
#define Pin_LSB_6_PORT GPIO_PRT13
#define Pin_LSB_6_SLEWRATE CY_GPIO_SLEW_FAST
#define Pin_LSB_6_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS
#define Pin_LSB_7_DRIVEMODE CY_GPIO_DM_STRONG
#define Pin_LSB_7_INBUF_ENABLED 1u
#define Pin_LSB_7_INIT_DRIVESTATE 1u
#define Pin_LSB_7_INIT_MUXSEL 2u
#define Pin_LSB_7_INPUT_SYNC 2u
#define Pin_LSB_7_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define Pin_LSB_7_NUM 1u
#define Pin_LSB_7_PORT GPIO_PRT13
#define Pin_LSB_7_SLEWRATE CY_GPIO_SLEW_FAST
#define Pin_LSB_7_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS

/* Pin_d_c */
#define Pin_d_c_0_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define Pin_d_c_0_INBUF_ENABLED 0u
#define Pin_d_c_0_INIT_DRIVESTATE 1u
#define Pin_d_c_0_INIT_MUXSEL 3u
#define Pin_d_c_0_INPUT_SYNC 2u
#define Pin_d_c_0_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define Pin_d_c_0_NUM 1u
#define Pin_d_c_0_PORT GPIO_PRT12
#define Pin_d_c_0_SLEWRATE CY_GPIO_SLEW_FAST
#define Pin_d_c_0_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS
#define Pin_d_c_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define Pin_d_c_INBUF_ENABLED 0u
#define Pin_d_c_INIT_DRIVESTATE 1u
#define Pin_d_c_INIT_MUXSEL 3u
#define Pin_d_c_INPUT_SYNC 2u
#define Pin_d_c_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define Pin_d_c_NUM 1u
#define Pin_d_c_PORT GPIO_PRT12
#define Pin_d_c_SLEWRATE CY_GPIO_SLEW_FAST
#define Pin_d_c_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS

