casapudenis/CY8CKIT-062-BLE/CE222221_Voice_Recorder01/CE222221_Voice_Recorder01.cydsn/codegentemp/cyfitter_gpio.h
/* Pin_ncs */
#define Pin_ncs_0_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define Pin_ncs_0_INBUF_ENABLED 0u
#define Pin_ncs_0_INIT_DRIVESTATE 1u
#define Pin_ncs_0_INIT_MUXSEL 3u
#define Pin_ncs_0_INPUT_SYNC 2u
#define Pin_ncs_0_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define Pin_ncs_0_NUM 5u
#define Pin_ncs_0_PORT GPIO_PRT1
#define Pin_ncs_0_SLEWRATE CY_GPIO_SLEW_FAST
#define Pin_ncs_0_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS
#define Pin_ncs_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define Pin_ncs_INBUF_ENABLED 0u
#define Pin_ncs_INIT_DRIVESTATE 1u
#define Pin_ncs_INIT_MUXSEL 3u
#define Pin_ncs_INPUT_SYNC 2u
#define Pin_ncs_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define Pin_ncs_NUM 5u
#define Pin_ncs_PORT GPIO_PRT1
#define Pin_ncs_SLEWRATE CY_GPIO_SLEW_FAST
#define Pin_ncs_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS

/* Pin_nrd */
#define Pin_nrd_0_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define Pin_nrd_0_INBUF_ENABLED 0u
#define Pin_nrd_0_INIT_DRIVESTATE 1u
#define Pin_nrd_0_INIT_MUXSEL 3u
#define Pin_nrd_0_INPUT_SYNC 2u
#define Pin_nrd_0_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define Pin_nrd_0_NUM 3u
#define Pin_nrd_0_PORT GPIO_PRT12
#define Pin_nrd_0_SLEWRATE CY_GPIO_SLEW_FAST
#define Pin_nrd_0_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS
#define Pin_nrd_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define Pin_nrd_INBUF_ENABLED 0u
#define Pin_nrd_INIT_DRIVESTATE 1u
#define Pin_nrd_INIT_MUXSEL 3u
#define Pin_nrd_INPUT_SYNC 2u
#define Pin_nrd_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define Pin_nrd_NUM 3u
#define Pin_nrd_PORT GPIO_PRT12
#define Pin_nrd_SLEWRATE CY_GPIO_SLEW_FAST
#define Pin_nrd_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS

/* Pin_nwr */
#define Pin_nwr_0_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define Pin_nwr_0_INBUF_ENABLED 0u
#define Pin_nwr_0_INIT_DRIVESTATE 1u
#define Pin_nwr_0_INIT_MUXSEL 3u
#define Pin_nwr_0_INPUT_SYNC 2u
#define Pin_nwr_0_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define Pin_nwr_0_NUM 0u
#define Pin_nwr_0_PORT GPIO_PRT12
#define Pin_nwr_0_SLEWRATE CY_GPIO_SLEW_FAST
#define Pin_nwr_0_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS
#define Pin_nwr_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define Pin_nwr_INBUF_ENABLED 0u
#define Pin_nwr_INIT_DRIVESTATE 1u
#define Pin_nwr_INIT_MUXSEL 3u
#define Pin_nwr_INPUT_SYNC 2u
#define Pin_nwr_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define Pin_nwr_NUM 0u
#define Pin_nwr_PORT GPIO_PRT12
#define Pin_nwr_SLEWRATE CY_GPIO_SLEW_FAST
#define Pin_nwr_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS

/* RED_LED */
#define RED_LED_0_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define RED_LED_0_INBUF_ENABLED 0u
#define RED_LED_0_INIT_DRIVESTATE 1u
#define RED_LED_0_INIT_MUXSEL 0u
#define RED_LED_0_INPUT_SYNC 2u
#define RED_LED_0_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define RED_LED_0_NUM 3u
#define RED_LED_0_PORT GPIO_PRT0
#define RED_LED_0_SLEWRATE CY_GPIO_SLEW_FAST
#define RED_LED_0_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS
#define RED_LED_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define RED_LED_INBUF_ENABLED 0u
#define RED_LED_INIT_DRIVESTATE 1u
#define RED_LED_INIT_MUXSEL 0u
#define RED_LED_INPUT_SYNC 2u
#define RED_LED_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define RED_LED_NUM 3u
#define RED_LED_PORT GPIO_PRT0
#define RED_LED_SLEWRATE CY_GPIO_SLEW_FAST
#define RED_LED_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS

/* PDM_DATA */
#define PDM_DATA_0_DRIVEMODE CY_GPIO_DM_HIGHZ
#define PDM_DATA_0_INBUF_ENABLED 1u
#define PDM_DATA_0_INIT_DRIVESTATE 0u
#define PDM_DATA_0_INIT_MUXSEL 21u
#define PDM_DATA_0_INPUT_SYNC 2u
#define PDM_DATA_0_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define PDM_DATA_0_NUM 5u
#define PDM_DATA_0_PORT GPIO_PRT10
#define PDM_DATA_0_SLEWRATE CY_GPIO_SLEW_FAST
#define PDM_DATA_0_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS
#define PDM_DATA_DRIVEMODE CY_GPIO_DM_HIGHZ
#define PDM_DATA_INBUF_ENABLED 1u
#define PDM_DATA_INIT_DRIVESTATE 0u
#define PDM_DATA_INIT_MUXSEL 21u
#define PDM_DATA_INPUT_SYNC 2u
#define PDM_DATA_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define PDM_DATA_NUM 5u
#define PDM_DATA_PORT GPIO_PRT10
#define PDM_DATA_SLEWRATE CY_GPIO_SLEW_FAST
#define PDM_DATA_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS

/* CapSense_Rx */
#define CapSense_Rx_0_DRIVEMODE CY_GPIO_DM_ANALOG
#define CapSense_Rx_0_INBUF_ENABLED 0u
#define CapSense_Rx_0_INIT_DRIVESTATE 1u
#define CapSense_Rx_0_INIT_MUXSEL 4u
#define CapSense_Rx_0_INPUT_SYNC 2u
#define CapSense_Rx_0_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define CapSense_Rx_0_NUM 1u
#define CapSense_Rx_0_PORT GPIO_PRT8
#define CapSense_Rx_0_SLEWRATE CY_GPIO_SLEW_FAST
#define CapSense_Rx_0_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS
#define CapSense_Rx_1_DRIVEMODE CY_GPIO_DM_ANALOG
#define CapSense_Rx_1_INBUF_ENABLED 0u
#define CapSense_Rx_1_INIT_DRIVESTATE 1u
#define CapSense_Rx_1_INIT_MUXSEL 4u
#define CapSense_Rx_1_INPUT_SYNC 2u
#define CapSense_Rx_1_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define CapSense_Rx_1_NUM 2u
#define CapSense_Rx_1_PORT GPIO_PRT8
#define CapSense_Rx_1_SLEWRATE CY_GPIO_SLEW_FAST
#define CapSense_Rx_1_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS

/* CapSense_Tx */
#define CapSense_Tx_0_DRIVEMODE CY_GPIO_DM_ANALOG
#define CapSense_Tx_0_INBUF_ENABLED 0u
#define CapSense_Tx_0_INIT_DRIVESTATE 1u
#define CapSense_Tx_0_INIT_MUXSEL 0u
#define CapSense_Tx_0_INPUT_SYNC 2u
#define CapSense_Tx_0_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define CapSense_Tx_0_NUM 0u
#define CapSense_Tx_0_PORT GPIO_PRT1
#define CapSense_Tx_0_SLEWRATE CY_GPIO_SLEW_FAST
#define CapSense_Tx_0_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS
#define CapSense_Tx_DRIVEMODE CY_GPIO_DM_ANALOG
#define CapSense_Tx_INBUF_ENABLED 0u
#define CapSense_Tx_INIT_DRIVESTATE 1u
#define CapSense_Tx_INIT_MUXSEL 0u
#define CapSense_Tx_INPUT_SYNC 2u
#define CapSense_Tx_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define CapSense_Tx_NUM 0u
#define CapSense_Tx_PORT GPIO_PRT1
#define CapSense_Tx_SLEWRATE CY_GPIO_SLEW_FAST
#define CapSense_Tx_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS

/* Intf_nreset */
#define Intf_nreset_0_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define Intf_nreset_0_INBUF_ENABLED 0u
#define Intf_nreset_0_INIT_DRIVESTATE 0u
#define Intf_nreset_0_INIT_MUXSEL 0u
#define Intf_nreset_0_INPUT_SYNC 2u
#define Intf_nreset_0_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define Intf_nreset_0_NUM 2u
#define Intf_nreset_0_PORT GPIO_PRT12
#define Intf_nreset_0_SLEWRATE CY_GPIO_SLEW_FAST
#define Intf_nreset_0_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS
#define Intf_nreset_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define Intf_nreset_INBUF_ENABLED 0u
#define Intf_nreset_INIT_DRIVESTATE 0u
#define Intf_nreset_INIT_MUXSEL 0u
#define Intf_nreset_INPUT_SYNC 2u
#define Intf_nreset_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define Intf_nreset_NUM 2u
#define Intf_nreset_PORT GPIO_PRT12
#define Intf_nreset_SLEWRATE CY_GPIO_SLEW_FAST
#define Intf_nreset_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS

/* CapSense_Sns */
#define CapSense_Sns_0_DRIVEMODE CY_GPIO_DM_ANALOG
#define CapSense_Sns_0_INBUF_ENABLED 0u
#define CapSense_Sns_0_INIT_DRIVESTATE 1u
#define CapSense_Sns_0_INIT_MUXSEL 0u
#define CapSense_Sns_0_INPUT_SYNC 2u
#define CapSense_Sns_0_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define CapSense_Sns_0_NUM 3u
#define CapSense_Sns_0_PORT GPIO_PRT8
#define CapSense_Sns_0_SLEWRATE CY_GPIO_SLEW_FAST
#define CapSense_Sns_0_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS
#define CapSense_Sns_1_DRIVEMODE CY_GPIO_DM_ANALOG
#define CapSense_Sns_1_INBUF_ENABLED 0u
#define CapSense_Sns_1_INIT_DRIVESTATE 1u
#define CapSense_Sns_1_INIT_MUXSEL 0u
#define CapSense_Sns_1_INPUT_SYNC 2u
#define CapSense_Sns_1_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define CapSense_Sns_1_NUM 4u
#define CapSense_Sns_1_PORT GPIO_PRT8
#define CapSense_Sns_1_SLEWRATE CY_GPIO_SLEW_FAST
#define CapSense_Sns_1_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS
#define CapSense_Sns_2_DRIVEMODE CY_GPIO_DM_ANALOG
#define CapSense_Sns_2_INBUF_ENABLED 0u
#define CapSense_Sns_2_INIT_DRIVESTATE 1u
#define CapSense_Sns_2_INIT_MUXSEL 0u
#define CapSense_Sns_2_INPUT_SYNC 2u
#define CapSense_Sns_2_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define CapSense_Sns_2_NUM 5u
#define CapSense_Sns_2_PORT GPIO_PRT8
#define CapSense_Sns_2_SLEWRATE CY_GPIO_SLEW_FAST
#define CapSense_Sns_2_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS
#define CapSense_Sns_3_DRIVEMODE CY_GPIO_DM_ANALOG
#define CapSense_Sns_3_INBUF_ENABLED 0u
#define CapSense_Sns_3_INIT_DRIVESTATE 1u
#define CapSense_Sns_3_INIT_MUXSEL 0u
#define CapSense_Sns_3_INPUT_SYNC 2u
#define CapSense_Sns_3_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define CapSense_Sns_3_NUM 6u
#define CapSense_Sns_3_PORT GPIO_PRT8
#define CapSense_Sns_3_SLEWRATE CY_GPIO_SLEW_FAST
#define CapSense_Sns_3_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS
#define CapSense_Sns_4_DRIVEMODE CY_GPIO_DM_ANALOG
#define CapSense_Sns_4_INBUF_ENABLED 0u
#define CapSense_Sns_4_INIT_DRIVESTATE 1u
#define CapSense_Sns_4_INIT_MUXSEL 0u
#define CapSense_Sns_4_INPUT_SYNC 2u
#define CapSense_Sns_4_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define CapSense_Sns_4_NUM 7u
#define CapSense_Sns_4_PORT GPIO_PRT8
#define CapSense_Sns_4_SLEWRATE CY_GPIO_SLEW_FAST
#define CapSense_Sns_4_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS

