casapudenis/CY8CKIT-062-BLE/CE222221_Voice_Recorder01/CE222221_Voice_Recorder01.cydsn/codegentemp/cyfitter_gpio.h
/* CapSense_Cmod */
#define CapSense_Cmod_0_DRIVEMODE CY_GPIO_DM_ANALOG
#define CapSense_Cmod_0_INBUF_ENABLED 0u
#define CapSense_Cmod_0_INIT_DRIVESTATE 1u
#define CapSense_Cmod_0_INIT_MUXSEL 0u
#define CapSense_Cmod_0_INPUT_SYNC 2u
#define CapSense_Cmod_0_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define CapSense_Cmod_0_NUM 7u
#define CapSense_Cmod_0_PORT GPIO_PRT7
#define CapSense_Cmod_0_SLEWRATE CY_GPIO_SLEW_FAST
#define CapSense_Cmod_0_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS
#define CapSense_Cmod_DRIVEMODE CY_GPIO_DM_ANALOG
#define CapSense_Cmod_INBUF_ENABLED 0u
#define CapSense_Cmod_INIT_DRIVESTATE 1u
#define CapSense_Cmod_INIT_MUXSEL 0u
#define CapSense_Cmod_INPUT_SYNC 2u
#define CapSense_Cmod_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define CapSense_Cmod_NUM 7u
#define CapSense_Cmod_PORT GPIO_PRT7
#define CapSense_Cmod_SLEWRATE CY_GPIO_SLEW_FAST
#define CapSense_Cmod_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS

/* CodecI2CM_scl */
#define CodecI2CM_scl_0_DRIVEMODE CY_GPIO_DM_OD_DRIVESLOW
#define CodecI2CM_scl_0_INBUF_ENABLED 1u
#define CodecI2CM_scl_0_INIT_DRIVESTATE 1u
#define CodecI2CM_scl_0_INIT_MUXSEL 19u
#define CodecI2CM_scl_0_INPUT_SYNC 2u
#define CodecI2CM_scl_0_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define CodecI2CM_scl_0_NUM 0u
#define CodecI2CM_scl_0_PORT GPIO_PRT6
#define CodecI2CM_scl_0_SLEWRATE CY_GPIO_SLEW_FAST
#define CodecI2CM_scl_0_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS
#define CodecI2CM_scl_DRIVEMODE CY_GPIO_DM_OD_DRIVESLOW
#define CodecI2CM_scl_INBUF_ENABLED 1u
#define CodecI2CM_scl_INIT_DRIVESTATE 1u
#define CodecI2CM_scl_INIT_MUXSEL 19u
#define CodecI2CM_scl_INPUT_SYNC 2u
#define CodecI2CM_scl_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define CodecI2CM_scl_NUM 0u
#define CodecI2CM_scl_PORT GPIO_PRT6
#define CodecI2CM_scl_SLEWRATE CY_GPIO_SLEW_FAST
#define CodecI2CM_scl_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS

/* CodecI2CM_sda */
#define CodecI2CM_sda_0_DRIVEMODE CY_GPIO_DM_OD_DRIVESLOW
#define CodecI2CM_sda_0_INBUF_ENABLED 1u
#define CodecI2CM_sda_0_INIT_DRIVESTATE 1u
#define CodecI2CM_sda_0_INIT_MUXSEL 19u
#define CodecI2CM_sda_0_INPUT_SYNC 2u
#define CodecI2CM_sda_0_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define CodecI2CM_sda_0_NUM 1u
#define CodecI2CM_sda_0_PORT GPIO_PRT6
#define CodecI2CM_sda_0_SLEWRATE CY_GPIO_SLEW_FAST
#define CodecI2CM_sda_0_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS
#define CodecI2CM_sda_DRIVEMODE CY_GPIO_DM_OD_DRIVESLOW
#define CodecI2CM_sda_INBUF_ENABLED 1u
#define CodecI2CM_sda_INIT_DRIVESTATE 1u
#define CodecI2CM_sda_INIT_MUXSEL 19u
#define CodecI2CM_sda_INPUT_SYNC 2u
#define CodecI2CM_sda_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define CodecI2CM_sda_NUM 1u
#define CodecI2CM_sda_PORT GPIO_PRT6
#define CodecI2CM_sda_SLEWRATE CY_GPIO_SLEW_FAST
#define CodecI2CM_sda_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS

/* CapSense_CintA */
#define CapSense_CintA_0_DRIVEMODE CY_GPIO_DM_ANALOG
#define CapSense_CintA_0_INBUF_ENABLED 0u
#define CapSense_CintA_0_INIT_DRIVESTATE 1u
#define CapSense_CintA_0_INIT_MUXSEL 0u
#define CapSense_CintA_0_INPUT_SYNC 2u
#define CapSense_CintA_0_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define CapSense_CintA_0_NUM 1u
#define CapSense_CintA_0_PORT GPIO_PRT7
#define CapSense_CintA_0_SLEWRATE CY_GPIO_SLEW_FAST
#define CapSense_CintA_0_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS
#define CapSense_CintA_DRIVEMODE CY_GPIO_DM_ANALOG
#define CapSense_CintA_INBUF_ENABLED 0u
#define CapSense_CintA_INIT_DRIVESTATE 1u
#define CapSense_CintA_INIT_MUXSEL 0u
#define CapSense_CintA_INPUT_SYNC 2u
#define CapSense_CintA_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define CapSense_CintA_NUM 1u
#define CapSense_CintA_PORT GPIO_PRT7
#define CapSense_CintA_SLEWRATE CY_GPIO_SLEW_FAST
#define CapSense_CintA_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS

/* CapSense_CintB */
#define CapSense_CintB_0_DRIVEMODE CY_GPIO_DM_ANALOG
#define CapSense_CintB_0_INBUF_ENABLED 0u
#define CapSense_CintB_0_INIT_DRIVESTATE 1u
#define CapSense_CintB_0_INIT_MUXSEL 0u
#define CapSense_CintB_0_INPUT_SYNC 2u
#define CapSense_CintB_0_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define CapSense_CintB_0_NUM 2u
#define CapSense_CintB_0_PORT GPIO_PRT7
#define CapSense_CintB_0_SLEWRATE CY_GPIO_SLEW_FAST
#define CapSense_CintB_0_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS
#define CapSense_CintB_DRIVEMODE CY_GPIO_DM_ANALOG
#define CapSense_CintB_INBUF_ENABLED 0u
#define CapSense_CintB_INIT_DRIVESTATE 1u
#define CapSense_CintB_INIT_MUXSEL 0u
#define CapSense_CintB_INPUT_SYNC 2u
#define CapSense_CintB_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define CapSense_CintB_NUM 2u
#define CapSense_CintB_PORT GPIO_PRT7
#define CapSense_CintB_SLEWRATE CY_GPIO_SLEW_FAST
#define CapSense_CintB_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS

/* SMIF_1_spi_clk */
#define SMIF_1_spi_clk_0_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define SMIF_1_spi_clk_0_INBUF_ENABLED 0u
#define SMIF_1_spi_clk_0_INIT_DRIVESTATE 1u
#define SMIF_1_spi_clk_0_INIT_MUXSEL 17u
#define SMIF_1_spi_clk_0_INPUT_SYNC 2u
#define SMIF_1_spi_clk_0_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define SMIF_1_spi_clk_0_NUM 7u
#define SMIF_1_spi_clk_0_PORT GPIO_PRT11
#define SMIF_1_spi_clk_0_SLEWRATE CY_GPIO_SLEW_FAST
#define SMIF_1_spi_clk_0_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS
#define SMIF_1_spi_clk_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define SMIF_1_spi_clk_INBUF_ENABLED 0u
#define SMIF_1_spi_clk_INIT_DRIVESTATE 1u
#define SMIF_1_spi_clk_INIT_MUXSEL 17u
#define SMIF_1_spi_clk_INPUT_SYNC 2u
#define SMIF_1_spi_clk_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define SMIF_1_spi_clk_NUM 7u
#define SMIF_1_spi_clk_PORT GPIO_PRT11
#define SMIF_1_spi_clk_SLEWRATE CY_GPIO_SLEW_FAST
#define SMIF_1_spi_clk_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS

/* SMIF_1_spi_data_0 */
#define SMIF_1_spi_data_0_0_DRIVEMODE CY_GPIO_DM_STRONG
#define SMIF_1_spi_data_0_0_INBUF_ENABLED 1u
#define SMIF_1_spi_data_0_0_INIT_DRIVESTATE 1u
#define SMIF_1_spi_data_0_0_INIT_MUXSEL 17u
#define SMIF_1_spi_data_0_0_INPUT_SYNC 2u
#define SMIF_1_spi_data_0_0_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define SMIF_1_spi_data_0_0_NUM 6u
#define SMIF_1_spi_data_0_0_PORT GPIO_PRT11
#define SMIF_1_spi_data_0_0_SLEWRATE CY_GPIO_SLEW_FAST
#define SMIF_1_spi_data_0_0_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS
#define SMIF_1_spi_data_0_DRIVEMODE CY_GPIO_DM_STRONG
#define SMIF_1_spi_data_0_INBUF_ENABLED 1u
#define SMIF_1_spi_data_0_INIT_DRIVESTATE 1u
#define SMIF_1_spi_data_0_INIT_MUXSEL 17u
#define SMIF_1_spi_data_0_INPUT_SYNC 2u
#define SMIF_1_spi_data_0_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define SMIF_1_spi_data_0_NUM 6u
#define SMIF_1_spi_data_0_PORT GPIO_PRT11
#define SMIF_1_spi_data_0_SLEWRATE CY_GPIO_SLEW_FAST
#define SMIF_1_spi_data_0_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS

/* SMIF_1_spi_data_1 */
#define SMIF_1_spi_data_1_0_DRIVEMODE CY_GPIO_DM_STRONG
#define SMIF_1_spi_data_1_0_INBUF_ENABLED 1u
#define SMIF_1_spi_data_1_0_INIT_DRIVESTATE 1u
#define SMIF_1_spi_data_1_0_INIT_MUXSEL 17u
#define SMIF_1_spi_data_1_0_INPUT_SYNC 2u
#define SMIF_1_spi_data_1_0_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define SMIF_1_spi_data_1_0_NUM 5u
#define SMIF_1_spi_data_1_0_PORT GPIO_PRT11
#define SMIF_1_spi_data_1_0_SLEWRATE CY_GPIO_SLEW_FAST
#define SMIF_1_spi_data_1_0_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS
#define SMIF_1_spi_data_1_DRIVEMODE CY_GPIO_DM_STRONG
#define SMIF_1_spi_data_1_INBUF_ENABLED 1u
#define SMIF_1_spi_data_1_INIT_DRIVESTATE 1u
#define SMIF_1_spi_data_1_INIT_MUXSEL 17u
#define SMIF_1_spi_data_1_INPUT_SYNC 2u
#define SMIF_1_spi_data_1_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define SMIF_1_spi_data_1_NUM 5u
#define SMIF_1_spi_data_1_PORT GPIO_PRT11
#define SMIF_1_spi_data_1_SLEWRATE CY_GPIO_SLEW_FAST
#define SMIF_1_spi_data_1_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS

/* SMIF_1_spi_data_2 */
#define SMIF_1_spi_data_2_0_DRIVEMODE CY_GPIO_DM_STRONG
#define SMIF_1_spi_data_2_0_INBUF_ENABLED 1u
#define SMIF_1_spi_data_2_0_INIT_DRIVESTATE 1u
#define SMIF_1_spi_data_2_0_INIT_MUXSEL 17u
#define SMIF_1_spi_data_2_0_INPUT_SYNC 2u
#define SMIF_1_spi_data_2_0_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define SMIF_1_spi_data_2_0_NUM 4u
#define SMIF_1_spi_data_2_0_PORT GPIO_PRT11
#define SMIF_1_spi_data_2_0_SLEWRATE CY_GPIO_SLEW_FAST
#define SMIF_1_spi_data_2_0_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS
#define SMIF_1_spi_data_2_DRIVEMODE CY_GPIO_DM_STRONG
#define SMIF_1_spi_data_2_INBUF_ENABLED 1u
#define SMIF_1_spi_data_2_INIT_DRIVESTATE 1u
#define SMIF_1_spi_data_2_INIT_MUXSEL 17u
#define SMIF_1_spi_data_2_INPUT_SYNC 2u
#define SMIF_1_spi_data_2_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define SMIF_1_spi_data_2_NUM 4u
#define SMIF_1_spi_data_2_PORT GPIO_PRT11
#define SMIF_1_spi_data_2_SLEWRATE CY_GPIO_SLEW_FAST
#define SMIF_1_spi_data_2_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS

