casapudenis/CY8CKIT-062-BLE/CE222221_Voice_Recorder01/CE222221_Voice_Recorder01.cydsn/codegentemp/cyfitter_gpio.h
/* SMIF_1_spi_data_3 */
#define SMIF_1_spi_data_3_0_DRIVEMODE CY_GPIO_DM_STRONG
#define SMIF_1_spi_data_3_0_INBUF_ENABLED 1u
#define SMIF_1_spi_data_3_0_INIT_DRIVESTATE 1u
#define SMIF_1_spi_data_3_0_INIT_MUXSEL 17u
#define SMIF_1_spi_data_3_0_INPUT_SYNC 2u
#define SMIF_1_spi_data_3_0_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define SMIF_1_spi_data_3_0_NUM 3u
#define SMIF_1_spi_data_3_0_PORT GPIO_PRT11
#define SMIF_1_spi_data_3_0_SLEWRATE CY_GPIO_SLEW_FAST
#define SMIF_1_spi_data_3_0_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS
#define SMIF_1_spi_data_3_DRIVEMODE CY_GPIO_DM_STRONG
#define SMIF_1_spi_data_3_INBUF_ENABLED 1u
#define SMIF_1_spi_data_3_INIT_DRIVESTATE 1u
#define SMIF_1_spi_data_3_INIT_MUXSEL 17u
#define SMIF_1_spi_data_3_INPUT_SYNC 2u
#define SMIF_1_spi_data_3_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define SMIF_1_spi_data_3_NUM 3u
#define SMIF_1_spi_data_3_PORT GPIO_PRT11
#define SMIF_1_spi_data_3_SLEWRATE CY_GPIO_SLEW_FAST
#define SMIF_1_spi_data_3_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS

/* SMIF_1_spi_select0 */
#define SMIF_1_spi_select0_0_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define SMIF_1_spi_select0_0_INBUF_ENABLED 0u
#define SMIF_1_spi_select0_0_INIT_DRIVESTATE 1u
#define SMIF_1_spi_select0_0_INIT_MUXSEL 17u
#define SMIF_1_spi_select0_0_INPUT_SYNC 2u
#define SMIF_1_spi_select0_0_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define SMIF_1_spi_select0_0_NUM 2u
#define SMIF_1_spi_select0_0_PORT GPIO_PRT11
#define SMIF_1_spi_select0_0_SLEWRATE CY_GPIO_SLEW_FAST
#define SMIF_1_spi_select0_0_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS
#define SMIF_1_spi_select0_DRIVEMODE CY_GPIO_DM_STRONG_IN_OFF
#define SMIF_1_spi_select0_INBUF_ENABLED 0u
#define SMIF_1_spi_select0_INIT_DRIVESTATE 1u
#define SMIF_1_spi_select0_INIT_MUXSEL 17u
#define SMIF_1_spi_select0_INPUT_SYNC 2u
#define SMIF_1_spi_select0_INTERRUPT_MODE CY_GPIO_INTR_DISABLE
#define SMIF_1_spi_select0_NUM 2u
#define SMIF_1_spi_select0_PORT GPIO_PRT11
#define SMIF_1_spi_select0_SLEWRATE CY_GPIO_SLEW_FAST
#define SMIF_1_spi_select0_THRESHOLD_LEVEL CY_GPIO_VTRIP_CMOS

#endif /* INCLUDED_CYFITTER_GPIO_H */
